<?php
//**************************************************
// 初期処理
//**************************************************
    //SESSIONスタート
    session_start();

    //データベース接続関数の定義ファイルを読み込み
    require_once('../model/dbconnect.php');

    //データベース操作関数の定義ファイルを読み込み
    require_once('../model/dbfunction.php');
//**************************************************
// 変数取得
//**************************************************
//**************************************************
// ログインチェック
//**************************************************
    if(!isset($_SESSION['admin_is_login']) || $_SESSION['admin_is_login'] !== true){
        header("location: login"); // 管理者ログイン画面に戻す
        exit();
    }
    // 管理者としてログイン中か、教員としてログイン中か（今後、権限ごとにUIを出し分ける想定）
    $admin_role = isset($_SESSION['admin_role']) ? $_SESSION['admin_role'] : "";
    $chapterSectionQuestions = getAll();
//**************************************************
// HTMLを出力
//**************************************************
    //画面へ表示
    require_once('../view_admin/admin.php');

?>